duxinglang-1/nRF9160_test/AURI_TEST/src/screen/screen.c
void StepsScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_STEPS].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_STEPS].status = SCREEN_STATUS_CREATED;

		StepsShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_STEPS].para&SCREEN_EVENT_UPDATE_SPORT)
			scr_msg[SCREEN_ID_STEPS].para &= (~SCREEN_EVENT_UPDATE_SPORT);

		StepsUpdateStatus();
		break;
	}

	scr_msg[SCREEN_ID_STEPS].act = SCREEN_ACTION_NO;
}

void DistanceUpdateStatus(void)
{
	u16_t distance;
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};

	GetSportData(NULL,NULL,&distance);

	LCD_ShowImg(DIS_NUM_1_X, DIS_NUM_1_Y, img_num[distance/10000]);
	LCD_ShowImg(DIS_NUM_2_X, DIS_NUM_2_Y, img_num[(distance%10000)/1000]);
	LCD_ShowImg(DIS_DOT_X, DIS_DOT_Y, IMG_DOT);
	LCD_ShowImg(DIS_NUM_3_X, DIS_NUM_3_Y, img_num[(distance%100)/10]);
	LCD_ShowImg(DIS_NUM_4_X, DIS_NUM_4_Y, img_num[distance%10]);
}

void DistanceShowStatus(void)
{
	u16_t distance;
	unsigned char *img_anima[2] = {IMG_DISTANCE_ICON_1, IMG_DISTANCE_ICON_2};
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};
	unsigned char *img_km[2] = {IMG_KM_CN, IMG_KM_EN};
	
	GetSportData(NULL,NULL,&distance);

	LCD_Clear(BLACK);
	
	AnimaShow(DIS_ICON_X, DIS_ICON_Y, img_anima, ARRAY_SIZE(img_anima), 500, true, NULL);

	LCD_ShowImg(DIS_NUM_1_X, DIS_NUM_1_Y, img_num[distance/10000]);
	LCD_ShowImg(DIS_NUM_2_X, DIS_NUM_2_Y, img_num[(distance%10000)/1000]);
	LCD_ShowImg(DIS_DOT_X, DIS_DOT_Y, IMG_DOT);
	LCD_ShowImg(DIS_NUM_3_X, DIS_NUM_3_Y, img_num[(distance%100)/10]);
	LCD_ShowImg(DIS_NUM_4_X, DIS_NUM_4_Y, img_num[distance%10]);
	
	if(global_settings.language == LANGUAGE_CHN)
		LCD_ShowImg(DIS_KM_X, DIS_KM_Y, img_km[0]);
	else
		LCD_ShowImg(DIS_KM_X, DIS_KM_Y, img_km[1]);
}

void DistanceScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_DISTANCE].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_DISTANCE].status = SCREEN_STATUS_CREATED;

		DistanceShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_DISTANCE].para&SCREEN_EVENT_UPDATE_SPORT)
			scr_msg[SCREEN_ID_DISTANCE].para &= (~SCREEN_EVENT_UPDATE_SPORT);

		DistanceUpdateStatus();
		break;
	}

	scr_msg[SCREEN_ID_DISTANCE].act = SCREEN_ACTION_NO;
}

void CalorieUpdateStatus(void)
{
	u16_t distance;
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};

	GetSportData(NULL,NULL,&distance);

	LCD_ShowImg(DIS_NUM_1_X, DIS_NUM_1_Y, img_num[distance/10000]);
	LCD_ShowImg(DIS_NUM_2_X, DIS_NUM_2_Y, img_num[(distance%10000)/1000]);
	LCD_ShowImg(DIS_DOT_X, DIS_DOT_Y, IMG_DOT);
	LCD_ShowImg(DIS_NUM_3_X, DIS_NUM_3_Y, img_num[(distance%1000)/100]);
	LCD_ShowImg(DIS_NUM_4_X, DIS_NUM_4_Y, img_num[distance%100]);
}

void CalorieShowStatus(void)
{
	u16_t calorie;
	unsigned char *img_anima[2] = {IMG_CAL_ICON_1, IMG_CAL_ICON_2};
	unsigned char *img_num[10] = {IMG_MID_NUM_0,IMG_MID_NUM_1,IMG_MID_NUM_2,IMG_MID_NUM_3,IMG_MID_NUM_4,
							  IMG_MID_NUM_5,IMG_MID_NUM_6,IMG_MID_NUM_7,IMG_MID_NUM_8,IMG_MID_NUM_9};
	unsigned char *img_cal[2] = {IMG_CAL_CN, IMG_CAL_EN};
	
	GetSportData(NULL,&calorie,NULL);

	LCD_Clear(BLACK);
	
	AnimaShow(CAL_ICON_X, CAL_ICON_Y, img_anima, ARRAY_SIZE(img_anima), 500, true, NULL);

	LCD_ShowImg(CAL_NUM_1_X, CAL_NUM_1_Y, img_num[calorie/1000]);
	LCD_ShowImg(CAL_NUM_2_X, CAL_NUM_2_Y, img_num[(calorie%1000)/100]);
	LCD_ShowImg(CAL_NUM_3_X, CAL_NUM_3_Y, img_num[(calorie%100)/10]);
	LCD_ShowImg(CAL_NUM_4_X, CAL_NUM_4_Y, img_num[calorie%10]);
	
	if(global_settings.language == LANGUAGE_CHN)
		LCD_ShowImg(CAL_UNIT_X, CAL_UNIT_Y, img_cal[0]);
	else
		LCD_ShowImg(CAL_UNIT_X, CAL_UNIT_Y, img_cal[1]);
}

void CalorieScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_CALORIE].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_CALORIE].status = SCREEN_STATUS_CREATED;

		CalorieShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_CALORIE].para&SCREEN_EVENT_UPDATE_SPORT)
			scr_msg[SCREEN_ID_CALORIE].para &= (~SCREEN_EVENT_UPDATE_SPORT);

		CalorieUpdateStatus();
		break;
	}

	scr_msg[SCREEN_ID_CALORIE].act = SCREEN_ACTION_NO;
}

void FallUpdateStatus(void)
{
	unsigned char *img_anima_send[3] = {IMG_SOS_SENDING_1, IMG_SOS_SENDING_2, IMG_SOS_SENDING_3};
	unsigned char *img_fall[2] = {IMG_FALL_CN, IMG_FALL_EN};
	unsigned char *img_cancel[2] = {IMG_FALL_MSG_CANCEL_CN, IMG_FALL_MSG_CANCEL_EN};

	LCD_Clear(BLACK);
	
	switch(fall_state)
	{
	case FALL_STATUS_IDLE:
		break;
		
	case FALL_STATUS_NOTIFY:
		break;
	
	case FALL_STATUS_SENDING:
		AnimaShow(MSG_SENDING_X, MSG_SENDING_Y, img_anima_send, ARRAY_SIZE(img_anima_send), 500, true, NULL);

		if(global_settings.language == LANGUAGE_CHN)
			LCD_ShowImg(FALL_TEXT_X, FALL_TEXT_Y, img_fall[0]);
		else
			LCD_ShowImg(FALL_TEXT_X, FALL_TEXT_Y, img_fall[1]);	
		break;
		
	case FALL_STATUS_SENT:
		break;
		
	case FALL_STATUS_CANCEL:
		AnimaStopShow();
		
		if(global_settings.language == LANGUAGE_CHN)
			LCD_ShowImg(FALL_CANCEL_CN_X, FALL_CANCEL_CN_Y, img_cancel[0]);
		else
			LCD_ShowImg(FALL_CANCEL_EN_X, FALL_CANCEL_EN_Y, img_cancel[1]);	
		break;

	case FALL_STATUS_CANCELED:
		break;
	}
}

void FallShowStatus(void)
{
	unsigned char *img_anima[3] = {IMG_FALL_ICON_1, IMG_FALL_ICON_2,IMG_FALL_ICON_3};
	unsigned char *img_fall[2] = {IMG_FALL_CN, IMG_FALL_EN};

	LCD_Clear(BLACK);

	AnimaShow(FALL_ICON_X, FALL_ICON_Y, img_anima, ARRAY_SIZE(img_anima), 500, true, NULL);

	if(global_settings.language == LANGUAGE_CHN)
		LCD_ShowImg(FALL_TEXT_X, FALL_TEXT_Y, img_fall[0]);
	else
		LCD_ShowImg(FALL_TEXT_X, FALL_TEXT_Y, img_fall[1]);
}


void FallScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_FALL].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_FALL].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_FALL].status = SCREEN_STATUS_CREATED;

		FallShowStatus();
		break;
		
