duxinglang-1/nRF9160_test/AURI_TEST/src/screen/screen.c
	screen_id = SCREEN_ID_CALORIE;	
	scr_msg[SCREEN_ID_CALORIE].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_CALORIE].status = SCREEN_STATUS_CREATING;

	k_timer_stop(&mainmenu_timer);
	
	MenuStopGPS();
	AnimaStopShow();

	SetLeftKeyUpHandler(EnterSleepScreen);
}

void ExitDistanceScreen(void)
{
	EnterIdleScreen();
}

void EnterDistanceScreen(void)
{
	if(screen_id == SCREEN_ID_DISTANCE)
		return;

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_DISTANCE;	
	scr_msg[SCREEN_ID_DISTANCE].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_DISTANCE].status = SCREEN_STATUS_CREATING;

	k_timer_stop(&mainmenu_timer);

	MenuStopGPS();
	AnimaStopShow();

	SetLeftKeyUpHandler(EnterCalorieScreen);
}

void ExitStepsScreen(void)
{
	EnterIdleScreen();
}

void EnterStepsScreen(void)
{
	if(screen_id == SCREEN_ID_STEPS)
		return;

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_STEPS;	
	scr_msg[SCREEN_ID_STEPS].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_STEPS].status = SCREEN_STATUS_CREATING;

	SetLeftKeyUpHandler(EnterDistanceScreen);
}

void EnterFallScreen(void)
{
	if(screen_id == SCREEN_ID_FALL)
		return;

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_FALL;	
	scr_msg[SCREEN_ID_FALL].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_FALL].status = SCREEN_STATUS_CREATING;
}

#endif

void EnterIdleScreen(void)
{
	if(screen_id == SCREEN_ID_IDLE)
		return;

	LCD_Set_BL_Mode(LCD_BL_AUTO);

	AnimaStopShow();
	k_timer_stop(&notify_timer);
	k_timer_stop(&mainmenu_timer);

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_IDLE;
	scr_msg[SCREEN_ID_IDLE].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_IDLE].status = SCREEN_STATUS_CREATING;

#if defined(CONFIG_PPG_SUPPORT)
	SetLeftKeyUpHandler(EnterHRScreen);
#else
	SetLeftKeyUpHandler(EnterStepsScreen);
#endif
}

void EnterAlarmScreen(void)
{
	if(screen_id == SCREEN_ID_ALARM)
		return;

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_ALARM;	
	scr_msg[SCREEN_ID_ALARM].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_ALARM].status = SCREEN_STATUS_CREATING;	
}

void ExitFindDeviceScreen(void)
{
	if(screen_id == SCREEN_ID_FIND_DEVICE)
	{
		EnterIdleScreen();
	}	
}

void EnterFindDeviceScreen(void)
{
	if(screen_id == SCREEN_ID_FIND_DEVICE)
		return;

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_FIND_DEVICE;	
	scr_msg[SCREEN_ID_FIND_DEVICE].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_FIND_DEVICE].status = SCREEN_STATUS_CREATING;
}


void poweroff_leftkeyfunc(void)
{
	LOG_INF("[%s]\n", __func__);
	key_pwroff_flag = true;
	
	scr_msg[SCREEN_ID_POWEROFF].act = SCREEN_ACTION_UPDATE;

	ClearAllKeyHandler();
}

void poweroff_rightkeyfunc(void)
{
	LOG_INF("[%s]\n", __func__);
	EnterIdleScreen();
}

void ExitPoweroffScreen(void)
{
	k_timer_stop(&mainmenu_timer);
	EnterIdleScreen();
}

void EnterPoweroffScreen(void)
{
	if(screen_id == SCREEN_ID_POWEROFF)
		return;

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_POWEROFF;	
	scr_msg[SCREEN_ID_POWEROFF].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_POWEROFF].status = SCREEN_STATUS_CREATING;

	k_timer_stop(&mainmenu_timer);
	AnimaStopShow();

	SetLeftKeyUpHandler(ExitPoweroffScreen);
	SetLeftKeyLongPressHandler(poweroff_leftkeyfunc);
}

void PowerOffUpdateStatus(void)
{
	unsigned char *img_pwroff[2] = {IMG_PWROFF_CN, IMG_PWROFF_EN};

	LCD_Clear(BLACK);

	LCD_ShowImg(PWR_OFF_ICON_X, PWR_OFF_ICON_Y, IMG_PWROFF_ICON);
	if(global_settings.language == LANGUAGE_CHN)
		LCD_ShowImg(PWR_OFF_CN_X, PWR_OFF_CN_Y, img_pwroff[0]);
	else
		LCD_ShowImg(PWR_OFF_EN_X, PWR_OFF_EN_Y, img_pwroff[1]);
}

void PowerOffShowStatus(void)
{
	unsigned char *img_pwroff_key[2] = {IMG_PWROFF_KEY_CN, IMG_PWROFF_KEY_EN};
	
	LCD_Clear(BLACK);

	LCD_ShowImg(PWR_OFF_ICON_X, PWR_OFF_ICON_Y, IMG_PWROFF_ICON);
	if(global_settings.language == LANGUAGE_CHN)
		LCD_ShowImg(PWR_OFF_KEY_CN_X, PWR_OFF_KEY_CN_Y, img_pwroff_key[0]);
	else
		LCD_ShowImg(PWR_OFF_KEY_EN_X, PWR_OFF_KEY_EN_Y, img_pwroff_key[1]);
}

void PowerOffScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_POWEROFF].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_POWEROFF].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_POWEROFF].status = SCREEN_STATUS_CREATED;

		PowerOffShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		PowerOffUpdateStatus();
		break;
	}
	
	scr_msg[SCREEN_ID_POWEROFF].act = SCREEN_ACTION_NO;
}

void ExitGPSTestScreen(void)
{
	k_timer_stop(&mainmenu_timer);
	if(gps_is_working())
		MenuStopGPS();
	
	EnterIdleScreen();
}

void EnterGPSTestScreen(void)
{
	if(screen_id == SCREEN_ID_GPS_TEST)
		return;

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_GPS_TEST;	
	scr_msg[SCREEN_ID_GPS_TEST].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_GPS_TEST].status = SCREEN_STATUS_CREATING;

	LCD_Set_BL_Mode(LCD_BL_ALWAYS_ON);

	k_timer_stop(&mainmenu_timer);
	k_timer_start(&mainmenu_timer, K_SECONDS(3), NULL);

#ifdef CONFIG_PPG_SUPPORT
	PPGStopCheck();
#endif

	SetLeftKeyUpHandler(EnterNBTestScreen);
}

void ExitBLETestScreen(void)
{
	k_timer_stop(&mainmenu_timer);
	
	EnterIdleScreen();
}

void EnterBLETestScreen(void)
{
	if(screen_id == SCREEN_ID_BLE_TEST)
		return;

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

